using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _000_About_Attributes
{
    class Program
    {
        static void Main(string[] args)
        {
            //Атрибуты пришли к нам из аспектно-ориентированного программирования. 
            //А тех языках были аспекты, а Microsoft назвало их атрибуты

            //Аттибуты полицейского: дубинка, наручники, полицеский значек, пистолет.
            //По этим атрибутам мы определили, что это и есть полицейский.

            //Атрибуты доктора: форма, шапка с красным крестом, аппарат для прослушивания дыания, шприц и т.д

            //Аттрибут пассажира: билет.

            //Аттрибут депутата - удостоверение депутата.

            //Атрибут шахтера - отбойным молоток. Мы по этому атрибуту узнаем шахтера, а он в любой момент может воспольоваться
            //своим аттрибутом.

            //Быват обычные аттрибуты, а бывают сложные аттрибуты(приборы у космонафта)
        }
    }
}
