namespace _000_About_Activator
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
            Класс Activator(creator) содержит методы для локального создания типов объектов.

            Метод Createnstance() создаем экземпляр типа, определенного в сборке
            путем вызова конструктора, который наилучшим образом соответствует заданным аргументам.

            ИТОГО: класс Activator позволяет создавать ЭКЗЕМПЛЯРЫ НЕИЗВЕСТНЫХ ТИПОВ  на стадии компиляции!
            Т.е когда программа компилируется - она ещё не знает экземпляры каких классов она будет создавать!
             */
        }
    }
}
