namespace _000_About_Type
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
             // Type  - абстрактный класс!
             Type является корневым классом для функциональных возможностей рефлексии и основным способом доступа к метаданным.

            //С помощью членов класса Type можно получить сведения об объявленных в типе элементах:
            //конструкторах, методах, полях, свойствах и событиях класса, а также о модуле, сборке,
            //в которых развернут данный класс.

            //ОБФУСКАЦИЯ И ДОТФУСКАЦИЯ - это механизмы, которые шифруют коды, меняют названия методов, классов и т.д на нечитаемые символы.

            //Способы получение экземпляра класса Type:
            1. Вызов метода GetType() на экземпляре требуемого класса.
            2. Вызов статичесого метода GetType() класса Type.
            3. Использование оператора typeof().
            4. Используя класс Assembly.Load("AssemblyPath").GetType("полное квалифицирование имя класса- например Carlibrary.MiniVan")
            ***В приведеных выше примерах результатом будет ссылка на объект Type, СОДЕРЖАШИЙ ИНФОРМАЦИЮ О ЦЕЛЕВОМ ТИПЕ.

             */
            

        }
    }
}
