using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace _000_О_жествком_диске
{
    class Program
    {
        static void Main(string[] args)
        {
            //Когда мы откроем гермоблок диска - мы увидим там красивий блестящий блин.(есть 1, 2х, 3х блинный диск)
            //Головка индуктивности на больших скоростях парит над поверхнстью диска и под ней создается водушная подушка, чтобы
            //она не касалась блинов. 
            //Головка индуктивнсти правильно намагничивает вещество. Если головка случайно чиркнет об поверхность блина
            //то будет микровзрыв, вылетит вещество и осядет в другом месте - тем самым портя информацию. Если говорят, что
            //повредитлся сектор, то это означает, что головка случайно чиркнула.
            
            //Головка индуктивность магнитит домены(маленький-маленький кусочек) вещества.
            //Синяя стрелка указывает на север - это будет 1. Если на юг - 0.

            //Микросхема BIOS - Basic Input Output System. Тут хранятся маленькие программы, которые позволяют выполнять базовые операции
            //с вводом - выводом информации. Например - с клавиатурой и т.д.
            //Диск может иметь несколько сторон, каждая сторона делится на дорожки. И диск делится на сектора. Но мы никтогда не пользяется чистым
            //сектором.
            
        }
    }
}
